{
    "projects": [
        {
            "name":"Binary Code", 
            "tags": ["Finished", "Public"],
            "thumbnail_src": "assets/images/binary.webp", 
            "description": "Binary Code is a slideshow I made for a school presentation. It's made with SCSS and TypeScript. It includes nice animations, cool visuals, is'nt really responsive and was made only for this presentation.", 
            "url": "https://dragonjules.github.io/Binary-Code/",
            "date": "Oct 7, 2023"
        },
        {
            "name":"Transposition", 
            "tags": ["Private", "In Progress"],
            "thumbnail_src": "assets/images/transposition.webp", 
            "description": "This project, developed in Python, aims at creating an application capable of scanning musical scores from a photo and reading them, via Optical Music Recongnition, in order to transpose them so that they can be played by several instruments.", 
            "url": "",
            "date": "Aug 17, 2023"
        },
        {
            "name":"Shop Bot", 
            "tags": ["Finished", "Public"],
            "thumbnail_src": "assets/images/shopbot.webp", 
            "description": "This open source, self-hosted, Discord bot developed in JavaScript, with the latest version of Discord's API, allows anyone to create easily virtual shops and currencies on their Discord server. It uses local database with JSON, and Discord's latest functionalities for bots, in order to create the best possible experience for both administrators and users.", 
            "url": "https://github.com/DragonJules/ShopBot",
            "date": "June 2023"
        },
        {
            "name":"Break Out", 
            "tags": ["In Progress", "Public"],
            "thumbnail_src": "assets/images/breakout.webp", 
            "description": "This Break Out game is a project I developed to improve my JavaScript skills, it's pretty simple, and probably not really well made (absolutely not responsive!), but it works. I should rework it, so it has the 'In Progress' status.", 
            "url": "https://dragonjules.github.io/BreakOut/",
            "date": "July 2022"
        },
        {
            "name":"Syntax", 
            "tags": ["In Progress", "Public"],
            "thumbnail_src": "assets/images/syntax.webp", 
            "description": "Syntax is a silly project, that I developed in a few hours, and that just replaces strings by other strings. But it has a funny application, and I want to finish it so it's easy to use.", 
            "url": "https://github.com/DragonJules/SYNTAX/",
            "date": "May 2022"
        },
        {
            "name":"Code Editor for Syntax", 
            "tags": ["In Progress", "Public"],
            "thumbnail_src": "assets/images/codeeditor.webp", 
            "description": "This small, but really annoying project, is just a textarea that colors keywords. I did that so it can be used with Syntax, in order to have a sort of complete new programming language. It's not completely finished. (it also has a gradient background that is randomly generated, because I think it's cool)", 
            "url": "https://dragonjules.github.io/CodeEditor/",
            "date": "Nov 27, 2022"
        }
    ]
}
